//
//  aboutViewController.swift
//  teacHeraPp
//
//  Created by Macintosh on 13/03/2024.
//

import UIKit

class aboutViewController: UIViewController {

    @IBOutlet weak var label: UILabel!
    @IBOutlet weak var label1: UILabel!
    @IBOutlet weak var label2: UILabel!
    @IBOutlet weak var label3: UILabel!
    @IBOutlet weak var label4: UILabel!
    override func viewDidLoad() {
        super.viewDidLoad()
        label.text = "\u{2022}هذا النص هو مثال لنص يمكن أن يستبدل في نفس  حيث لقد  المساحة، لقد تم توليد النص من مولد النص العربى،  يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق هذا النص هو مثال لنص يمكن أن يستبدل في نفس  حيث لقد  المساحة، لقد تم توليد النص من مولد النص العربى، "
        label1.text = "\u{2022}هذا النص هو مثال لنص يمكن أن يستبدل في نفس  حيث لقد  المساحة، لقد تم توليد النص من مولد النص العربى،  يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق هذا النص هو مثال لنص يمكن أن يستبدل في نفس  حيث لقد  المساحة، لقد تم توليد النص من مولد النص العربى، "
        label2.text = "\u{2022}هذا النص هو مثال لنص يمكن أن يستبدل في نفس  حيث لقد  المساحة، لقد تم توليد النص من مولد النص العربى،  يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق هذا النص هو مثال لنص يمكن أن يستبدل في نفس  حيث لقد  المساحة، لقد تم توليد النص من مولد النص العربى، "
        label3.text = "\u{2022}هذا النص هو مثال لنص يمكن أن يستبدل في نفس  حيث لقد  المساحة، لقد تم توليد النص من مولد النص العربى،  يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق هذا النص هو مثال لنص يمكن أن يستبدل في نفس  حيث لقد  المساحة، لقد تم توليد النص من مولد النص العربى، "
        label4.text = "\u{2022}هذا النص هو مثال لنص يمكن أن يستبدل في نفس  حيث لقد  المساحة، لقد تم توليد النص من مولد النص العربى،  يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق هذا النص هو مثال لنص يمكن أن يستبدل في نفس  حيث لقد  المساحة، لقد تم توليد النص من مولد النص العربى، "

    }
    

   
    @IBAction func back(_ sender: Any) {
        navigationController?.popViewController(animated: true)
    }
    
}
